export default [
    `
'Теперь разберем массивы (array):'
// Массив - это упорядоченная коллекция
[] // это пустой массив

Внутри может лежать что угодно:
[34, 'Ключи от квартиры', 'строка с эмодзи 🎉'];

А этот ящик фруктов - это тоже массив
['🍎', '🍐', '🍊', '🍑', '🍍', '🍇'];
// элементы разделены запятой!

"тут будет задание на последовательное собирание массива из предложенных элеменов ][",текст"

Потом подмешаются неправильные элементы также

Потом предложится ввести с клавиатуры массив

В конце тест
Выберите пустой массив

§§[""]±§[]±[0]±null§§;

+ что-то еще
`,
    `
// объяви пустой массив
§>const±emptyArray±=±[]±§{±§}±delete§>`,
];
